protogia/avr-descriptionfiles-4-nim/svd/ATmega809.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLKCTRL</name>
      <description>Clock controller</description>
      <baseAddress>0x00000060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCLKCTRLA</name>
          <description>MCLK Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC20M</name>
                  <description>16/20MHz internal oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCULP32K</name>
                  <description>32.768kHz internal ultra low-power oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>32.768kHz external crystal oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT</name>
              <description>System clock out</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCTRLB</name>
          <description>MCLK Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEN</name>
              <description>Prescaler enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIV</name>
              <description>Prescaler division</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2X</name>
                  <description>2X</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4X</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8X</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16X</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32X</name>
                  <description>32X</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64X</name>
                  <description>64X</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6X</name>
                  <description>6X</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10X</name>
                  <description>10X</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12X</name>
                  <description>12X</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24X</name>
                  <description>24X</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48X</name>
                  <description>48X</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKLOCK</name>
          <description>MCLK Lock</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCKEN</name>
              <description>Lock enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKSTATUS</name>
          <description>MCLK Status</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SOSC</name>
              <description>System Oscillator changing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC20MS</name>
              <description>20MHz oscillator status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC32KS</name>
              <description>32KHz oscillator status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC32KS</name>
              <description>32.768 kHz Crystal Oscillator status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTS</name>
              <description>External Clock status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC20MCALIBA</name>
          <description>OSC20M Calibration A</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAL20M</name>
              <description>Calibration</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC20MCALIBB</name>
          <description>OSC20M Calibration B</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMPCAL20M</name>
              <description>Oscillator temperature coefficient</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC20MCTRLA</name>
          <description>OSC20M Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32KCTRLA</name>
          <description>OSC32K Control A</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32KCTRLA</name>
          <description>XOSC32K Control A</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL</name>
              <description>Select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSUT</name>
              <description>Crystal startup time</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1k cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16k cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32k cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64k cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
